{
  "Articles": [
    {
      "title": "Full Stack In Three Months: The Truth Behind Coding Bootcamps",
      "date": "21 March 2019",
      "bodyA": "Before you read any further, take a moment to mentally picture one of those “expectation vs reality” memes off Instagram. This is exactly how I would describe the early stages of learning to code. At the beginning of my journey, I had hugely underestimated the nature of software development. I knew it would be challenging, but I was massively oblivious to just how fast-paced embarking on a coding boot camp would actually be. The jump from completing a few online katas every night in bed to actually sitting in a classroom full of other budding developers left me feeling inadequate and intellectually fraudulent. So how did I cope and how would I advise others?",
      "bodyB": "First things first, have a meltdown and get it all out of your system! Honestly, this is the best thing you can do to stop yourself feeling so frustrated. Once this step is complete, FIND YOURSELF A MENTOR! Having a friend who’s experienced all this before is the most motivating thing in the world. Whether it’s pair-programming over Zoom on the weekends, or just reflecting on a difficult day over WhatsApp, they can help give you perspective and guidance which enables you to take a step back and measure your progress. Alongside having a mentor, it’s also good to find a fellow code newbie that feels the same as you. Some people aren’t vocal about their worries but you can really learn a lot from what other people are going through if you communicate your failures. (It’s also a bonus when you can celebrate your successes together too!).",
      "bodyC": "Another key factor in learning to code which I wish someone had told me earlier… Don’t be afraid to be the most stupid person in the room. Surround yourself with intelligent people, ask questions, and soak it all up like a sponge. Be curious and if you don’t know something, practice it until you do. Never copy and paste code unless you know what it actually does. If in doubt, follow a YouTube tutorial that clearly explains any new concepts that you haven’t encountered before. Be warned however: Everyone finds solutions and makes decisions differently. Stealing from Stack Overflow can sometimes cause you massive issues further down the line unless you fully understand what the original author of the code was thinking when he/she wrote it.",
      "bodyD": "All in all, if you work hard and care about the quality of the code you produce you cannot go wrong! In my first week it took me a full day to do one kata but by my second week it would only take me an hour. The only reason I managed to build up that sort of pace was by asking for help when I was stuck and not sitting there looking around and panicking about how everyone else had got their functions working before me. Look at the bigger picture and compare yourself to your past-self and not the person sat next to you. This will help you feel like you’ve achieved something and in turn make you a lot more confident. Programming languages and tools have come a long way in the past few years so now is the best time to get involved and start learning. My code bootcamp experience was beyond amazing and I would whole-heartedly recommend it to anyone!",
      "href": "/blog/21March2019",
      "slug": "21March2019"
    }
  ]
}
